package com.alpha;

public class Task21 {
    public static void main(String[] args) {
        /*
        2. Добавьте в пакет com.alpha пакет work1, в котором опишите класс Runner
        c методом run(), а также добавьте в код метода main() создание экземпляра
        класса Runner и вызов на нем метода run().
        3. Добавьте в пакет work1 хорошо инкапсулированный класс Book (ID,
        Название, Автор, Издательство, Год издания, Количество страниц,
        Стоимость).
        4. Добавьте в метод run() код создания и вывода одного объекта типа Book.
         */
    }

}

